// У Петра есть некоторое количество денег
const money = 1000;


// цена телефона, который он хочет купить
const price = 12000;


// максимальное количество месяцев рассрочки
const loanMaxMonth = 10;


// a. Вычислите минимальный ежемесячный платеж используя переменные
// описанные выше и оператор деления.
const monthlyPayment = ВАШ_КОД_ТУТ;


// b. Может ли Петр получить телефон сегодня,
// если первый взнос надо внести во время покупки?
// Запишите вычисление с помощью переменных, операторов деления и сравнения.
const canBuyNow = ВАШ_КОД_ТУТ;


// 3. какие типы данных сохранились в переменные monthlyPayment и canBuyNow?
// boolean | number | string
