// 1. Напишите функцию-конструктор (с большой буквы название)
// которая генерирует случайное число от -100 до 100 и записывает его в создаваемый объект
// используя this (не в замыкание)

// Добавьте в объект метод showNumber, который выводит это число в консоль и
// метод isNegative, который возвращает true если число меньше ноля.

function /**

<ВАШ_КОД_ТУТ>

*/

// 2. Создайте объект с помощью оператора new (в новую константу присвойте результат
// вызова вашей функции счерез оператор new)


// 3. Создайте константу с пустым массивом. Используя цикл for создайте 10 таких же объектов
// и с помощью push добавьте в массив


// 4. Теперь, когда наши 10 объектов находятся в массиве мы можем с ними работать,
// также как работали с объектами ранее. Используйте метод массива filter и используя isNegative
// из ваших объектов отберите отрицательные числа.
// Используя forEach и метод объекта showNumber отобразите числа в консоль.

