// В массиве есть знакомый нам метод every,
// жаль, что такого же не т в строке.
// Постойте, используя метод функции .call
// мы можем вызвать метод массива НА строке

// 1. создайте пустой массив
const array = // ВАШ КОД ТУТ

// 2. сохраните его метод .every в константу every
const every = // ВАШ КОД ТУТ

// 3. напишите (или найдите в прошлых заданиях)
// нашу старую знакомую функцию isVowel, которая
// возвращает true, если буква гласная
const isVowel = // ВАШ КОД ТУТ

// 4. проверьте, все ли буквы в строке гласные,
// вызвав функцию every передав в this строку
const test = 'aouiyedo';

console.log(every. // ВАШ КОД ТУТ


// по желанию, можно записать это без промежуточных
// переменных в одну строку
